UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/саУНФ_ДополнительнаяКонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_ДополнительнаяКонтактнаяИнформация</name>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_adress</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/Forms/ФормаДобавленияАдреса/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Контрагент") Тогда
	        Закрыть();
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);	
КонецПроцедуры

#Область Создать

&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	Элементы.СписокСоздать,
	ЭтотОбъект,
	"АдресДоставкиДополнительно",
	Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультат(Элемент, Объект, ИмяРеквизитаАдресаДоставки, СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	АдресПредставление = ИмяРеквизитаАдресаДоставки;
	АдресЗначение = ИмяРеквизитаАдресаДоставки + "Значение";
	ДополнительнаяИнформацияПоДоставке="";
	АдресПредставление ="";
    АдресЗначение = "";	
	
	// Откроем диалог редактирования КИ
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагета"));
	ПараметрыОткрытия.Вставить("Значение", АдресЗначение);
	ПараметрыОткрытия.Вставить("Представление", АдресПредставление);
	ПараметрыОткрытия.Вставить("Комментарий", ДополнительнаяИнформацияПоДоставке);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", ИмяРеквизитаАдресаДоставки);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
	ЭтаФорма, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда // КИ введена
		ДобавитьЗаписьВРегистр(Результат);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеЗаписи()
	//"Адрес доставки " 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(саУНФ_ДополнительнаяКонтактнаяИнформация.Наименование, 0)) КАК Наименование
		|ПОМЕСТИТЬ ВТ_МАКС
		|ИЗ
		|	РегистрСведений.саУНФ_ДополнительнаяКонтактнаяИнформация КАК саУНФ_ДополнительнаяКонтактнаяИнформация
		|ГДЕ
		|	саУНФ_ДополнительнаяКонтактнаяИнформация.Контрагент = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_МАКС.Наименование, 0) КАК Наименование
		|ИЗ
		|	ВТ_МАКС КАК ВТ_МАКС";
	
	Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	         Возврат 0;
	КонецЕсли; 
	Выборка = Результат.Выбрать();
	Выборка.Следующий(); 
	Возврат Выборка.Наименование;	
	
КонецФункции // ()
 


&НаСервере
Процедура ДобавитьЗаписьВРегистр(Результат)
	 ПоследнийНомер = ПолучитьНаименованиеЗаписи()+1;
	
	НаборЗаписей = РегистрыСведений.саУНФ_ДополнительнаяКонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Параметры.Контрагент);
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Наименование = ПоследнийНомер;
	НоваяЗапись.Контрагент = Параметры.Контрагент;
	НоваяЗапись.Вид = Результат.Вид;
	НоваяЗапись.Тип = Результат.Тип;
	НоваяЗапись.ЗначенияПолей=Результат.КонтактнаяИнформация;
	НоваяЗапись.Значение=Результат.Значение;
	НоваяЗапись.Представление = Результат.Представление;
    НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры
	
#КонецОбласти


#Область Редактировать

&НаСервере
Функция СтруктураПоКлючуРегистра(ВыбраннаяСтрока)
    НаборЗаписей = РегистрыСведений.саУНФ_ДополнительнаяКонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ВыбраннаяСтрока.Контрагент);
	НаборЗаписей.Отбор.Наименование.Установить(ВыбраннаяСтрока.Наименование); 
	НаборЗаписей.Прочитать();
	
	СтруктураЗаписи = Новый Структура("Наименование,Представление,ЗначениеПолей,Значение",);
	
	Для каждого Запись Из НаборЗаписей Цикл
	       ЗаполнитьЗначенияСвойств(СтруктураЗаписи,Запись);
	КонецЦикла; 
	

	 Возврат  СтруктураЗаписи;

КонецФункции // ()
 
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СтруктураЗаписи=СтруктураПоКлючуРегистра(ВыбраннаяСтрока);

	ОткрытьФормуВыбораАдресаИРедактироватьРезультат(
	Элементы.СписокСоздать,
	ЭтотОбъект,
	"АдресДоставкиДополнительно", 
	СтруктураЗаписи,
	Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдресаИРедактироватьРезультат(Элемент, Объект, ИмяРеквизитаАдресаДоставки, СтруктураЗаписи,СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	//АдресПредставление = ИмяРеквизитаАдресаДоставки;
	//АдресЗначение = ИмяРеквизитаАдресаДоставки + "Значение";
	ДополнительнаяИнформацияПоДоставке="";
	//АдресПредставление ="";
	//АдресЗначение = "";	
	//
	// Откроем диалог редактирования КИ
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагета"));
	ПараметрыОткрытия.Вставить("Значение", СтруктураЗаписи.Значение);
	ПараметрыОткрытия.Вставить("Представление", СтруктураЗаписи.Представление);
	ПараметрыОткрытия.Вставить("Комментарий", ДополнительнаяИнформацияПоДоставке);
	
	ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("Объект", ЭтотОбъект);
	//ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", ИмяРеквизитаАдресаДоставки);
	//ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	ДополнительныеПараметры.Вставить("Наименование", СтруктураЗаписи.Наименование);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИРедактироватьРезультатЗавершение", 
	ЭтаФорма, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдресаИРедактироватьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда // КИ введена
		ОбновитьЗаписьРегистра(Результат,ДополнительныеПараметры);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьРегистра(Результат,ДополнительныеПараметры)
	НаборЗаписей = РегистрыСведений.саУНФ_ДополнительнаяКонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Параметры.Контрагент);
	НаборЗаписей.Отбор.Наименование.Установить(ДополнительныеПараметры.Наименование);
	НаборЗаписей.Прочитать();
	
	Для каждого НоваяЗапись Из НаборЗаписей Цикл
		НоваяЗапись.ЗначенияПолей=Результат.КонтактнаяИнформация;
		НоваяЗапись.Значение=Результат.Значение;
		НоваяЗапись.Представление = Результат.Представление;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

	
#КонецОбласти
